{
  "_name_or_path": "/Users/meghanadhpulivarthi/Desktop/BTProject/Notebooks/iemocap_text_only/finetune_bert_iemocap_text/checkpoint-2212",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "ang",
    "1": "hap",
    "2": "neu",
    "3": "sad"
  },
  "initializer_range": 0.02,
  "label2id": {
    "ang": "0",
    "hap": "1",
    "neu": "2",
    "sad": "3"
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "vocab_size": 30522
}
